Ran Plan for 2 projects:

1. project: `cvm` dir: `cvm` workspace: `default`
1. project: `clb` dir: `clb` workspace: `default`
---

### 1. project: `cvm` dir: `cvm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
TmpSecretId=AKID45dJ2maWj4hE-Sp1aqWcM87LmI9mgO7UkOnXXqbR8B67MOKOv1e9HrbvheWp2Ryt
TmpSecretKey=pPrNJ0wcUXjJ+Jw9BtCCTtS1jmcJmiixphwqQI5xzCw=
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa7155a25fe30db9131d44d8d4bf47bf29XuHsxMPc5TaHFfLDjuMPuFdXxSPdsnJNwA0tGrXhVbLo2tZnpDDztC079MBKzhjeEVutctD9JhSeqKdWl6y6gK3OOxldLZCPpk_vb-n97R8wiqFQpNArm0Ar1ZdAn34CzwqXpqpho0BxNMDbGNKJNeMYbwUnuANqcenr56ogudUeYgeQ2rU8_eLk4BwaHuvB_X87IbGvSUiaPlSWda5987Djz-JyAsSgkCci0-CaCc2UIRAe2q0kWeo_kOBmk8geu809mWo4JkY8SIc3we_--pWtAwfhsV56-Lp6x4Pct_zA4HZQdlxoG98xwCQNofevNuCsPG4S3Qj1hHdFkpQCbiQNQhoVafjGFmnbLRufznLy6L8REZNUQFaqQfT9gVGyiixQ5pE3bZZn1A5MladmebtuouUN4TyexaLAh526TIw3fV6rXeRqPLNeCO_UNQg-tM40esa1ALfNfTV4gvSr0z0d6AslCQ5mRAqkGNPxNPcdi8s35waaDQLAOwfAcIwWJwNockbBOByJnwfu02SqQVsYEm493CW-LbadAFqORUUAUe_vizouhAcax-vnmyC_88t25ore9D0kBfONaKLBN_s1rA9Z-4ZC2GQGIXrTlxWhjvS-0qj84oSWHi1DN1duZlRcK9rQYOjqADiUS62UUur0Re69_gWoEBjVSTl2xF8
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKID45dJ2maWj4hE-Sp1aqWcM87LmI9mgO7UkOnXXqbR8B67MOKOv1e9HrbvheWp2Ryt
TENCENTCLOUD_SECRET_KEY=pPrNJ0wcUXjJ+Jw9BtCCTtS1jmcJmiixphwqQI5xzCw=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa7155a25fe30db9131d44d8d4bf47bf29XuHsxMPc5TaHFfLDjuMPuFdXxSPdsnJNwA0tGrXhVbLo2tZnpDDztC079MBKzhjeEVutctD9JhSeqKdWl6y6gK3OOxldLZCPpk_vb-n97R8wiqFQpNArm0Ar1ZdAn34CzwqXpqpho0BxNMDbGNKJNeMYbwUnuANqcenr56ogudUeYgeQ2rU8_eLk4BwaHuvB_X87IbGvSUiaPlSWda5987Djz-JyAsSgkCci0-CaCc2UIRAe2q0kWeo_kOBmk8geu809mWo4JkY8SIc3we_--pWtAwfhsV56-Lp6x4Pct_zA4HZQdlxoG98xwCQNofevNuCsPG4S3Qj1hHdFkpQCbiQNQhoVafjGFmnbLRufznLy6L8REZNUQFaqQfT9gVGyiixQ5pE3bZZn1A5MladmebtuouUN4TyexaLAh526TIw3fV6rXeRqPLNeCO_UNQg-tM40esa1ALfNfTV4gvSr0z0d6AslCQ5mRAqkGNPxNPcdi8s35waaDQLAOwfAcIwWJwNockbBOByJnwfu02SqQVsYEm493CW-LbadAFqORUUAUe_vizouhAcax-vnmyC_88t25ore9D0kBfONaKLBN_s1rA9Z-4ZC2GQGIXrTlxWhjvS-0qj84oSWHi1DN1duZlRcK9rQYOjqADiUS62UUur0Re69_gWoEBjVSTl2xF8

Initializing the backend...

Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
TmpSecretId=AKIDwEOYExBWwBfaiZsdBg0LQZT2_S2gbp5lQAw0MkNi_UqL1ihFX-GnwkQ57EM7qZEE
TmpSecretKey=aKGhgK7owmOvkV1EXjbW1czSE2Qu7JCBvMLLRMxQqqE=
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa8edfff20331781efaa966aab569cefffXuHsxMPc5TaHFfLDjuMPuHAFpmOFmZpZHBHP_smbbpbWBPFGJkgOAlaITG2JTgr3tQPfYaayc3pB9dDP6SAYR-Vst6gnCwG2vlgdXjz7gyszaRyfSLW1JOlY4RtwoHlgLduMfRDO3oYbdg_Vkq8axqXKWmrMNEEUUqicEPcdjvgTwEmMKtYBwC2TryjwXsGHW8s75Qkpcri9dwPEYZeb0RhfK9yrRdsvdvgptshYAOWKw8y1pMA9SckNgc8crUzKDorBh7sjtsFUYT22i4ppyZaDbjmxv2oPifM-UPDoEeX4FHBN5XRVwGWbKB8xM5YhOeJUzWikjk_zrGTR4eIJzaLLmEGQglfTmaGjHRo6bEOlAt4SCj5wNcjWdlDmGyH8btAdQfw2Xvn4smaemp-MAYRTmuK3SAGxKDkSiLinvncnK07rSqcjW0q6ejPKl288XNMxUWiFbv9MJk8PH642tNDStb3iNPaYuR74oPm0jjnJ_kceb3bUWuls2Exhi8bDvqCoYkikUO0iGybstSANj31Fn_13T2IqcS6m8gskKkMmFG32c-K6ygAn-fNS0EuK7f2s1bP3X_MeTs4pHsb540gzKLPYzxShRkP9gOSZuA-tT3_WIfE_5QB-wsNF3fWRZly04d2I0M5Zj0W-RyWHkf4Yz7a8iPHWJmFwAw5piJI
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDwEOYExBWwBfaiZsdBg0LQZT2_S2gbp5lQAw0MkNi_UqL1ihFX-GnwkQ57EM7qZEE
TENCENTCLOUD_SECRET_KEY=aKGhgK7owmOvkV1EXjbW1czSE2Qu7JCBvMLLRMxQqqE=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa8edfff20331781efaa966aab569cefffXuHsxMPc5TaHFfLDjuMPuHAFpmOFmZpZHBHP_smbbpbWBPFGJkgOAlaITG2JTgr3tQPfYaayc3pB9dDP6SAYR-Vst6gnCwG2vlgdXjz7gyszaRyfSLW1JOlY4RtwoHlgLduMfRDO3oYbdg_Vkq8axqXKWmrMNEEUUqicEPcdjvgTwEmMKtYBwC2TryjwXsGHW8s75Qkpcri9dwPEYZeb0RhfK9yrRdsvdvgptshYAOWKw8y1pMA9SckNgc8crUzKDorBh7sjtsFUYT22i4ppyZaDbjmxv2oPifM-UPDoEeX4FHBN5XRVwGWbKB8xM5YhOeJUzWikjk_zrGTR4eIJzaLLmEGQglfTmaGjHRo6bEOlAt4SCj5wNcjWdlDmGyH8btAdQfw2Xvn4smaemp-MAYRTmuK3SAGxKDkSiLinvncnK07rSqcjW0q6ejPKl288XNMxUWiFbv9MJk8PH642tNDStb3iNPaYuR74oPm0jjnJ_kceb3bUWuls2Exhi8bDvqCoYkikUO0iGybstSANj31Fn_13T2IqcS6m8gskKkMmFG32c-K6ygAn-fNS0EuK7f2s1bP3X_MeTs4pHsb540gzKLPYzxShRkP9gOSZuA-tT3_WIfE_5QB-wsNF3fWRZly04d2I0M5Zj0W-RyWHkf4Yz7a8iPHWJmFwAw5piJI

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.cvm_cicd_kk_1 will be created
  + resource "tencentcloud_instance" "cvm_cicd_kk_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + hostname                                = "user"
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cvm_cicd_kk_1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = 50
          + data_disk_type         = "CLOUD_PREMIUM"
          + delete_with_instance   = true
          + encrypt                = false
          + throughput_performance = 0
        }
    }

  # tencentcloud_subnet.cicd_kk will be created
  + resource "tencentcloud_subnet" "cicd_kk" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.1.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd_kk_subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_kk will be created
  + resource "tencentcloud_vpc" "cicd_kk" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd_kk_vpc"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)
  + public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cvm
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fcvm%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cvm
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `clb` dir: `clb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
TmpSecretId=AKID0YV4ARqeW4cPNSu8KwbQeHI7DnY8DJ38iPv7ANPdc9eA5ZTk37h6d8sDHCzANY47
TmpSecretKey=hjjAfrDvjoLNRf9CjFrAQ9Gy+M8thn5wVuTHStWwj9Q=
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa1ad4f2eefaf8fcbafd707d17be7b3c76XuHsxMPc5TaHFfLDjuMPuKiZWr-Ygw6G0Bb1cRefy9jE1E4yjNiKfXoNywWVH5Yg1xIQUWpRe895eNFxs0mjd6ZpP7ietSZFuu2898502DxNBENdEVRh2ip699kT62lZz_ZXzgWPSg6ezTxZ_AgsBRduR_V9Q-UQ_0GMTcHikxr5nNbW8DHs3iuxda9eWZlJxBWIz8C19qA_1igCC70tgxfjYR3XyLC4rSU1_Y9o3GYwqWTPExEBQKfUwdNCjmBVLNGSAfVyBUH3z37pIJMhRCFB6CALkESnKtt6gz9QpAcoZUkpxoQ__mbac3mTZsvECFb-7M0ghrQV5vWVHcEDVWBJv_g8r_y1k13Sk1xieFI15oX7QxmocY5whOhuVLIulCtpV_rjGtUHdFvkBlLWYI1VDiW9utkxAqaFHKNlWId4kUPZCLaGGU_GpIm7Rn0UeGcmsBIWdKN4s89gwwGrzMFlD4fAAh33G17bdD_OwKHh7t2qyP2fh0rMEw35d9medrM0YxnnPVSFEg9jh-96nJ5hxZ1vbpHrMzAj8hMcf7CIuW4IvW0pEo1iFgVBrtgC_UM_RuUxHABS7gjeCctnzIJuUCChHooKeV5NTCwKI6kPQXpn9zo1XuJaayqMMb9b3LBMi1LASL5KVwVs-InoApkqUJa6XWDupfHn1LBVr8U
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKID0YV4ARqeW4cPNSu8KwbQeHI7DnY8DJ38iPv7ANPdc9eA5ZTk37h6d8sDHCzANY47
TENCENTCLOUD_SECRET_KEY=hjjAfrDvjoLNRf9CjFrAQ9Gy+M8thn5wVuTHStWwj9Q=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa1ad4f2eefaf8fcbafd707d17be7b3c76XuHsxMPc5TaHFfLDjuMPuKiZWr-Ygw6G0Bb1cRefy9jE1E4yjNiKfXoNywWVH5Yg1xIQUWpRe895eNFxs0mjd6ZpP7ietSZFuu2898502DxNBENdEVRh2ip699kT62lZz_ZXzgWPSg6ezTxZ_AgsBRduR_V9Q-UQ_0GMTcHikxr5nNbW8DHs3iuxda9eWZlJxBWIz8C19qA_1igCC70tgxfjYR3XyLC4rSU1_Y9o3GYwqWTPExEBQKfUwdNCjmBVLNGSAfVyBUH3z37pIJMhRCFB6CALkESnKtt6gz9QpAcoZUkpxoQ__mbac3mTZsvECFb-7M0ghrQV5vWVHcEDVWBJv_g8r_y1k13Sk1xieFI15oX7QxmocY5whOhuVLIulCtpV_rjGtUHdFvkBlLWYI1VDiW9utkxAqaFHKNlWId4kUPZCLaGGU_GpIm7Rn0UeGcmsBIWdKN4s89gwwGrzMFlD4fAAh33G17bdD_OwKHh7t2qyP2fh0rMEw35d9medrM0YxnnPVSFEg9jh-96nJ5hxZ1vbpHrMzAj8hMcf7CIuW4IvW0pEo1iFgVBrtgC_UM_RuUxHABS7gjeCctnzIJuUCChHooKeV5NTCwKI6kPQXpn9zo1XuJaayqMMb9b3LBMi1LASL5KVwVs-InoApkqUJa6XWDupfHn1LBVr8U

Initializing the backend...

Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
TmpSecretId=AKIDjUMGNgEQLqQHiz9rT_xbsXd9dY2OXIvkUZPAGLRvqebLpRJ_6kGHEA71yPVPYvXX
TmpSecretKey=cUZF5AcA13QakcFAlE++rJ2v/+xZf4KG7R2wiMIRgd8=
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa0fa36c3e9d2d1cf316d237acc92253c4XuHsxMPc5TaHFfLDjuMPuEyNuXn3a3HLsgGP43l-Nq1I0rllqZ_fRfDShftMqgYBzgXGV0fo33YRV8QDPwKbdyylCIwGYoS_s9J716_f_4X1zrNkpUM37poKmd6MZORHbpIin3TQq1kfGgcOkkuNpA7kr4giGeq7_0DTDZYbyOpP9pTK1QkTz9C8RaBscVvggL4MFwVJTtwrRO6bvQy2pPX6vjnIpehJEA03pFqbXRLgRq9QvwPNx9vcbSuL0SXAIhdSSta7FkoM1wkvP8wm2qaLlVBVzHdfaPm4aLdN741VQw-yDksW9GueySKAEHH_tFpGbuP5TlY0wMpQZ22tH9Z7xHN0TAzAYkvZb1vFUjSEZN1JzIuUoeduALuZG87NJ380w7h-LvtY7-29_OzK-AqI4n-Bi6dN-AIZXRP4_I8ydkBZcUiU4Qmkqelx9ZTLf9hRMw8hAQ8S-qRz26Rnl4KpvXU4dTuk_LJ8BZuf-6n7VHLTkN3ZY9pWLdlBwimNP0ETnoLVvbh86Fl_5yJ4_yLhbSOsP9FOXQ-ymuYlSP-_nV7ovkVA6twW-6GVbDAXa2DmLzcAvddLVqEtDVOqL925cTL838uSTfP00le2F9bv9FB5pbNhQ9qgyvGYRJQtWry6LS3iLthQzUpRASuxu1IXIBJ9NsCSNeSXjrEIPW0
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDjUMGNgEQLqQHiz9rT_xbsXd9dY2OXIvkUZPAGLRvqebLpRJ_6kGHEA71yPVPYvXX
TENCENTCLOUD_SECRET_KEY=cUZF5AcA13QakcFAlE++rJ2v/+xZf4KG7R2wiMIRgd8=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa0fa36c3e9d2d1cf316d237acc92253c4XuHsxMPc5TaHFfLDjuMPuEyNuXn3a3HLsgGP43l-Nq1I0rllqZ_fRfDShftMqgYBzgXGV0fo33YRV8QDPwKbdyylCIwGYoS_s9J716_f_4X1zrNkpUM37poKmd6MZORHbpIin3TQq1kfGgcOkkuNpA7kr4giGeq7_0DTDZYbyOpP9pTK1QkTz9C8RaBscVvggL4MFwVJTtwrRO6bvQy2pPX6vjnIpehJEA03pFqbXRLgRq9QvwPNx9vcbSuL0SXAIhdSSta7FkoM1wkvP8wm2qaLlVBVzHdfaPm4aLdN741VQw-yDksW9GueySKAEHH_tFpGbuP5TlY0wMpQZ22tH9Z7xHN0TAzAYkvZb1vFUjSEZN1JzIuUoeduALuZG87NJ380w7h-LvtY7-29_OzK-AqI4n-Bi6dN-AIZXRP4_I8ydkBZcUiU4Qmkqelx9ZTLf9hRMw8hAQ8S-qRz26Rnl4KpvXU4dTuk_LJ8BZuf-6n7VHLTkN3ZY9pWLdlBwimNP0ETnoLVvbh86Fl_5yJ4_yLhbSOsP9FOXQ-ymuYlSP-_nV7ovkVA6twW-6GVbDAXa2DmLzcAvddLVqEtDVOqL925cTL838uSTfP00le2F9bv9FB5pbNhQ9qgyvGYRJQtWry6LS3iLthQzUpRASuxu1IXIBJ9NsCSNeSXjrEIPW0

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_clb_attachment.attachment_tcp will be created
  + resource "tencentcloud_clb_attachment" "attachment_tcp" {
      + clb_id        = (known after apply)
      + id            = (known after apply)
      + listener_id   = (known after apply)
      + protocol_type = (known after apply)

      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
    }

  # tencentcloud_clb_instance.cicd_foo will be created
  + resource "tencentcloud_clb_instance" "cicd_foo" {
      + address_ip_version           = (known after apply)
      + address_ipv6                 = (known after apply)
      + clb_name                     = "cicd_foo_clb"
      + clb_vips                     = (known after apply)
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + internet_bandwidth_max_out   = (known after apply)
      + internet_charge_type         = (known after apply)
      + ipv6_mode                    = (known after apply)
      + load_balancer_pass_to_target = false
      + master_zone_id               = (known after apply)
      + network_type                 = "OPEN"
      + project_id                   = 0
      + security_groups              = (known after apply)
      + sla_type                     = (known after apply)
      + slave_zone_id                = (known after apply)
      + target_region_info_region    = (known after apply)
      + target_region_info_vpc_id    = (known after apply)
      + vip                          = (known after apply)
      + vip_isp                      = (known after apply)
      + vpc_id                       = (known after apply)
      + zone_id                      = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_dst will be created
  + resource "tencentcloud_clb_listener" "listener_http_dst" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_dst"
      + port                       = 81
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_src will be created
  + resource "tencentcloud_clb_listener" "listener_http_src" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_src"
      + port                       = 80
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_tcp will be created
  + resource "tencentcloud_clb_listener" "listener_tcp" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = 2
      + health_check_http_code     = 2
      + health_check_http_method   = "GET"
      + health_check_http_version  = "HTTP/1.0"
      + health_check_interval_time = 100
      + health_check_port          = 200
      + health_check_switch        = true
      + health_check_time_out      = 30
      + health_check_type          = "HTTP"
      + health_check_unhealth_num  = 2
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_tcp"
      + port                       = 8080
      + protocol                   = "TCP"
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener_rule.rule_http_dst will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_dst" {
      + clb_id                     = (known after apply)
      + domain                     = "abcd.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_listener_rule.rule_http_src will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_src" {
      + clb_id                     = (known after apply)
      + domain                     = "abc.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_redirection.redirection_http will be created
  + resource "tencentcloud_clb_redirection" "redirection_http" {
      + clb_id                  = (known after apply)
      + delete_all_auto_rewrite = false
      + id                      = (known after apply)
      + source_listener_id      = (known after apply)
      + source_rule_id          = (known after apply)
      + target_listener_id      = (known after apply)
      + target_rule_id          = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_1 will be created
  + resource "tencentcloud_instance" "cicd_foo_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_2 will be created
  + resource "tencentcloud_instance" "cicd_foo_2" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm2"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)
    }

  # tencentcloud_security_group.cicd_foo will be created
  + resource "tencentcloud_security_group" "cicd_foo" {
      + id         = (known after apply)
      + name       = "cicd-foo-sg"
      + project_id = (known after apply)
    }

  # tencentcloud_subnet.cicd_foo will be created
  + resource "tencentcloud_subnet" "cicd_foo" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/16"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd-foo-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_foo will be created
  + resource "tencentcloud_vpc" "cicd_foo" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd-foo-vpc"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clb_instance_id  = (known after apply)
  + cvm1_instance_id = (known after apply)
  + cvm2_instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p clb
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fclb%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p clb
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```